package topic_2;

public class Project_2_5 {
    public static void main (String[] args) {

        /*
        Завдання 5
Створіть проект. Створіть змінну типу byte, надайте їй значення 99999, виведіть значення цієї змінної в консоль.
За виникнення помилки, використовуючи коментарі, напишіть, у чому помилка та привласніть це значення до
відповідного типу даних.
*/

// byte a = 99999; - змінна byte може містити число від -128 до 127, тому в неї не можна вписати число 99999.

        int a = 99999; // змінна int підходить, бо її діапазон більший.

        System.out.println(a);

    }
}
