package topic_5.project_5_3.project_5_3_1;

public class LogicOperations {
    public static void main(String[] args) {

        /* Завдання 3
Використовуючи IntelliJ IDEA, створіть клас LogicOperations. Є 3 змінні типу int x = 5, y = 10, і z = 15.
Виконайте та розрахуйте результат таких операцій для цих змінних:
§  x += y >> x++ * z;
§  z = ++x & y * 5;
§  y /= x + 5 | z;
§  z = x++ & y * 5;
§  x = y << x++ ^ z;*/

        int x = 5;
        int y = 10;
        int z = 15;


        //x += y >> x++ * z;
        /*
        x = 5 + (10 / 2 ^ (5 * 15)) = 5 + (10 / 2^75) = 5 + 2^(10 / 3.7e+22) = 5 + (2,7^0) = 5 + 0
        x = 5;
        */


        //z = ++x & y * 5;
        /*
        z = 6 & 10 * 5 = 6 & 50 = 2
        z = 2

        0000 0110  - 6
        0011 0010  - 50
        0000 0010  - 2
        */


        y /= x + 5 | z;
        /*
        y = 10 / (5 + 5 | 15) = 10 / (5 + 7) = 10 / 12 = 0
        y = 0

        0000 0101  - 5
        0000 1111  - 15
        0000 0111  - 7
        */

        //z = x++ & y * 5;
        /*
        z = 5 & 10 * 5 = 5 & 50 = 0
        z = 0

        0000 0101  - 5
        0011 0010  - 50
        0000 0000  - 0
        */

        //x = y << x++ ^ z;
        /*
        x = 10 * 2^ (5 ^ 15) = 10 * 2^10 = 10 * 1024 = 10 240;    10 * 2^5 ^ 15 = 320 ^ 15 = 335
        x = 335

        0001 0100 0000  - 5
        0000 0000 1111  - 15
        0001 0100 1111  - 335
        */


        System.out.println(x);
        System.out.println(y);
        System.out.println(z);


    }
}
