package topic_9.topic_9_2;

//Створіть проект за допомогою IntelliJ IDEA. Створіть клас MyList. Реалізуйте у найпростішому наближенні можливість використання його
// екземпляра аналогічно екземпляру класу List. Мінімально необхідний інтерфейс взаємодії з екземпляром повинен включати
// метод додавання елемента, індексатор для отримання значення елемента за вказаним індексом і властивість тільки для читання
// для отримання загальної кількості елементів.

public class Main {
    public static void main(String[] args) {
        MyList a = new MyList();

        for (int i = 0; i<10; i++){
            a.add(i);
            System.out.println(a.get(i));
        }

        System.out.println("Size of array: " + a.size());
    }
}
